src/src/Catalogs/Campaigns.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Campaigns</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>StartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Activities</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Activity</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CampaignActivities</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>HighlightColor</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/src/Catalogs/Campaigns/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Function GetFirstActivity(Campaign) Export
	
	Activity = Catalogs.CampaignActivities.EmptyRef();
	
	If ValueIsFilled(Campaign) Then
		
		Query = New Query;
		Query.Text = 
			"SELECT TOP 1
			|	CampaignsActivities.LineNumber AS LineNumber,
			|	CampaignsActivities.Activity AS Activity
			|FROM
			|	Catalog.Campaigns.Activities AS CampaignsActivities
			|WHERE
			|	CampaignsActivities.Ref = &Campaign
			|
			|ORDER BY
			|	CampaignsActivities.LineNumber";
		
		Query.SetParameter("Campaign", Campaign);
		
		QueryResult = Query.Execute();
		
		SelectionDetailRecords = QueryResult.Select();
		
		If SelectionDetailRecords.Next() Then
			Activity = SelectionDetailRecords.Activity;
		EndIf;
		
	EndIf;
	
	Return Activity;
	
EndFunction

#EndRegion

#EndIf
